% 1、用fminbnd求无约束优化数学模型
% （1） 
x=fminbnd('-(-5*x^2+9*x-7)',0,100)
y=-(-5*x^2+9*x-7)

% x =
% 
% 0.9000
% y =
% 
%     2.9500
% （2） （观其察局部、全局最优解）
% 局部：
x=[0:0.05:5]
y=exp(-2.*x).*cos(10.*x)+exp(-3.*x-6).*sin(2.*x)
plot(x,y)


 
X=fminbnd('exp(-2.*x).*cos(10.*x)+exp(-3.*x-6).*sin(2.*x)',0,1)
X =

0.2944
y =

   -0.5436
% 整体：
ezplot('exp(-2.*x).*cos(10.*x)+exp(-3.*x-6).*sin(2.*x)',0,100)
 
X=fminbnd('exp(-2.*x).*cos(10.*x)+exp(-3.*x-6).*sin(2.*x)',0,inf)
y=exp(-2.*x).*cos(10.*x)+exp(-3.*x-6).*sin(2.*x)
% x =
% 
%    Inf
% 
% 
% y =
% 
%    NaN
% 2、用fminunc求无约束优化数学模型
%       教材 第2题第（3）小题。注只求出局部极小点或全局极小点
% 局部：
x=[-1:0.1:1]
y=x
z=(x-2).^2+(y-1).^2+0.04./(-0.25.*x.^2-y.^2+1)+5.*(x-2.*y+1).^2
plot3(x,y,z)
 
function z=fun(x)
z=(x(1)-2).^2+(x(2)-1).^2+0.04./(-0.25.*x(1).^2-x(2).^2+1)+5.*(x(1)-2.*x(2)+1).^2;

x0=[1,1]
[xmin,zmin]=fminsearch(@fun,x0)

% Xmin=
% 
%     1.7954    1.3778
% 
% 
% Zmin =
% 
%     0.1690
% 整体：
x=[-10:0.1:10]
y=x
z=(x-2).^2+(y-1).^2+0.04./(-0.25.*x.^2-y.^2+1)+5.*(x-2.*y+1).^2
plot3(x,y,z)
 
x0=[-10,10]
[xmin,zmin]=fminunc(@fun,x0)

% xmin =
% 
%     1.7954    1.3779
% 
% 
% zmin =
% 
%     0.1690
% 3、用lsqcurvefit求无约束优化数学模型       
% 用下一组数据拟合 中的系数
% 数据见excel文件

function  y=fun(a,xdata)
y=a(1)*(exp(-a(2)*xdata)-exp(a(3)*xdata));

x0=[1,1,1]
xdata=[0.25 0.5 0.75 1 1.5  2 2.5 3 3.5 4 4.5 5 6 7 8 9 10 11 12 13 14 15 16]
ydata=[30 68 75 82 82 77 68 68 58 51 50 41 38 35 28 25 18 15 12 10 7 7 4]
[x,norm]=lsqcurvefit('fun',x0,xdata,ydata)

% x =
% 
%     0.0120   -0.8727    0.8727
% 
% 
% norm =
% 
%   5.4838e+004
